Revit 2024 API
MassLevelData.ConceptualConstructionId Property
 The ElementId of the conceptual construction associated with the MassLevelData (Mass Floor).
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public ElementId ConceptualConstructionId { get; set; }
Visual Basic
Public Property ConceptualConstructionId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ ConceptualConstructionId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The input ElementId conceptualConstructionId is not a valid conceptual construction type ElementId.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
MassLevelData Class
Autodesk.Revit.DB.Analysis Namespace